<details><summary>Show OpenTofu Plan</summary>

```


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # openstack_blockstorage_volume_v3.legacy_app6 will be imported
    resource "openstack_blockstorage_volume_v3" "legacy_app6" {
        attachment        = [
            {
                device      = "/dev/sdb"
                id          = "0bdf4b46-49a4-4eb4-8966-7eb6d2fdec90"
                instance_id = "9d7288ae-ad02-40a6-8976-495d63c040a0"
            },
        ]
        availability_zone = "nova"
        id                = "0bdf4b46-49a4-4eb4-8966-7eb6d2fdec90"
        metadata          = {}
        name              = "app-www"
        size              = 5
        volume_type       = "standard"
    }

  # openstack_compute_instance_v2.legacy_app6 will be imported
    resource "openstack_compute_instance_v2" "legacy_app6" {
        access_ip_v4      = "172.16.6.17"
        all_metadata      = {}
        all_tags          = []
        availability_zone = "nova"
        created           = "2022-08-29 18:09:44 +0000 UTC"
        flavor_id         = "41f0ea41-75ca-44a6-be66-bb56b2a90721"
        flavor_name       = "g4.cores1.ram2.disk20"
        id                = "9d7288ae-ad02-40a6-8976-495d63c040a0"
        image_id          = "9a01d3d8-e793-4775-8b81-434f68c687a7"
        image_name        = "debian-11.0-bullseye (deprecated 2023-01-12)"
        metadata          = {}
        name              = "accounts-appserver6"
        power_state       = "active"
        security_groups   = [
            "accounts-application",
            "accounts-default",
            "default",
            "web",
        ]
        tags              = []
        updated           = "2024-09-05 16:36:45 +0000 UTC"

        network {
            access_network = false
            fixed_ip_v4    = "172.16.6.17"
            mac            = "fa:16:3e:fa:84:a0"
            name           = "lan-flat-cloudinstances2b"
            uuid           = "7425e328-560c-4f00-8e99-706f3fb90bb4"
        }
    }

  # openstack_compute_volume_attach_v2.legacy_app6 will be imported
    resource "openstack_compute_volume_attach_v2" "legacy_app6" {
        device      = "/dev/sdb"
        id          = "9d7288ae-ad02-40a6-8976-495d63c040a0/0bdf4b46-49a4-4eb4-8966-7eb6d2fdec90"
        instance_id = "9d7288ae-ad02-40a6-8976-495d63c040a0"
        volume_id   = "0bdf4b46-49a4-4eb4-8966-7eb6d2fdec90"
    }

  # openstack_dns_recordset_v2.legacy_prod_app6 will be created
  + resource "openstack_dns_recordset_v2" "legacy_prod_app6" {
      + disable_status_check = false
      + id                   = (known after apply)
      + name                 = "app-legacy.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
      + project_id           = (known after apply)
      + records              = [
          + "172.16.6.17",
        ]
      + region               = (known after apply)
      + ttl                  = 900
      + type                 = "A"
      + zone_id              = "22fe5641-3813-47bf-b6ab-c6d17c1962c1"
    }

Plan: 3 to import, 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @stwalkerster, Action: `pull_request`*